In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [21]:
df = pd.read_csv('oasis_longitudinal.csv')
df.head()

,Subject ID,MRI ID,Group,Visit,MR Delay,M/F,Hand,Age,EDUC,SES,MMSE,CDR,eTIV,nWBV,ASF
0,OAS2_0001,OAS2_0001_MR1,Nondemented,1,0,M,R,87,14,2.0,27.0,0.0,1987,0.696,0.883
1,OAS2_0001,OAS2_0001_MR2,Nondemented,2,457,M,R,88,14,2.0,30.0,0.0,2004,0.681,0.876
2,OAS2_0002,OAS2_0002_MR1,Demented,1,0,M,R,75,12,NaN,23.0,0.5,1678,0.736,1.046
3,OAS2_0002,OAS2_0002_MR2,Demented,2,560,M,R,76,12,NaN,28.0,0.5,1738,0.713,1.010
4,OAS2_0002,OAS2_0002_MR3,Demented,3,1895,M,R,80,12,NaN,22.0,0.5,1698,0.701,1.034

In [22]:
df.drop(["Subject ID","MRI ID","Hand"],axis=1,inplace = True)

In [23]:
df['Group'].replace(['Nondemented','Demented','Converted'],[0,1,2],inplace = True)
df['M/F'].replace(['M','F'],[0,1],inplace = True)

In [25]:
x = df.drop("Group",axis =1)
y = df["Group"]
print(x.shape)
print(y.shape)
print(type(x))
print(type(y))

(373, 11)
(373,)
<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [30]:
df = pd.DataFrame(x)
df.head()

   Visit  MR Delay  M/F  Age  EDUC  SES  MMSE  CDR  eTIV   nWBV    ASF
0      1         0    0   87    14  2.0  27.0  0.0  1987  0.696  0.883
1      2       457    0   88    14  2.0  30.0  0.0  2004  0.681  0.876
2      1         0    0   75    12  NaN  23.0  0.5  1678  0.736  1.046
3      2       560    0   76    12  NaN  28.0  0.5  1738  0.713  1.010
4      3      1895    0   80    12  NaN  22.0  0.5  1698  0.701  1.034

In [33]:
df1 = pd.DataFrame(y)
df1.tail()

     Group
368      1
369      1
370      0
371      0
372      0

In [34]:
print(len(y))

373

In [37]:
y.value_counts()

0    190
1    146
2     37
Name: Group, dtype: int64

In [45]:
x.isnull().sum()

Visit        0
MR Delay     0
M/F          0
Age          0
EDUC         0
SES         19
MMSE         2
CDR          0
eTIV         0
nWBV         0
ASF          0
dtype: int64

In [47]:
x["SES"].fillna("0",inplace=True)
x["MMSE"].fillna("0",inplace=True)

In [48]:
from collections import Counter

In [49]:
print(Counter(y))

Counter({0: 190, 1: 146, 2: 37})

In [52]:

print(x.shape)
print(y.shape)

(373, 11)
(373,)

In [53]:
from sklearn.discriminant_analysis import LinearDiscriminantAnalysis

In [54]:
lda = LinearDiscriminantAnalysis()
lda_res = lda.fit_transform(x,y)
print(lda_res.shape)
print(type(lda_res))

(373, 2)
<class 'numpy.ndarray'>

In [55]:
lda_res[:5]

array([[ 1.19170638,  2.2121409 ],
       [ 1.53201724,  2.03104177],
       [-2.0185354 , -0.31135234],
       [-1.66327858, -0.72002278],
       [-1.59086802, -1.60168138]])

In [56]:
df_lda = pd.DataFrame(lda_res,columns=['lda1','lda2'])
df_lda.head()

       lda1      lda2
0  1.191706  2.212141
1  1.532017  2.031042
2 -2.018535 -0.311352
3 -1.663279 -0.720023
4 -1.590868 -1.601681